{
  "Balance Billing": {
    "explanation_for_user": "Balance billing happens when an out-of-network provider bills you for the difference between what they charged and what your insurance paid. Under the No Surprises Act, you may be protected from balance billing for emergency services and certain other situations.",
    "suggested_action": "Check if this service qualifies for No Surprises Act protection (emergency care, out-of-network provider at in-network facility). If protected, you should only owe your in-network cost-sharing amount. Contact your insurance and request IDR if needed. File a complaint with CMS within 120 days if applicable."
  },
  "Duplicate Billing": {
    "explanation_for_user": "You may have been charged twice for the same service, procedure, or supply. This is one of the most common billing errors and can significantly inflate your bill.",
    "suggested_action": "Compare line items carefully. Look for identical CPT codes, dates, and descriptions. Request an itemized bill if you don't have one. Contact the billing department immediately to dispute duplicate charges and request a corrected bill."
  },
  "Unbundling": {
    "explanation_for_user": "Unbundling is when a hospital bills separately for procedures that should be billed together as a single 'bundled' service. This practice can result in higher charges than appropriate.",
    "suggested_action": "Research which CPT codes are typically bundled together. The National Correct Coding Initiative (NCCI) can help identify improper unbundling. Request a review from your insurance company or contact the billing department to challenge these charges."
  },
  "Upcoding": {
    "explanation_for_user": "Upcoding occurs when you're billed for a more expensive or complex service than what was actually provided. For example, billing for a comprehensive exam when only a basic exam was performed.",
    "suggested_action": "Compare the billed CPT codes with your medical records and the actual services you received. Request copies of your medical records if needed. Dispute any codes that don't match the level of service documented. File a complaint with your insurance company."
  },
  "Facility Fee Issues": {
    "explanation_for_user": "Facility fees are charges hospitals add for using their space and equipment, even for outpatient services. These fees can be surprisingly high and are often unexpected, especially when the same procedure costs much less at a non-hospital facility.",
    "suggested_action": "Ask why a facility fee was charged and if it's required by your insurance. Compare to what the procedure would cost at an independent clinic. Request a detailed breakdown. Consider asking for a reduction or payment plan if the fee is valid but unaffordable."
  },
  "Services Not Rendered": {
    "explanation_for_user": "You've been billed for services, procedures, tests, or supplies that you never received. This could be due to clerical errors or potentially fraudulent billing.",
    "suggested_action": "Review your bill against your memory of the visit and any discharge paperwork. If something doesn't match, request your complete medical records. Dispute any charge for services you didn't receive in writing. If fraud is suspected, report to your insurance and potentially the state attorney general."
  },
  "Pre-EOB Billing": {
    "explanation_for_user": "You received a bill from the provider before your insurance company issued an Explanation of Benefits (EOB). You should wait for the EOB to know what you truly owe, as the initial bill may not reflect your insurance coverage or negotiated rates.",
    "suggested_action": "Do not pay this bill yet. Wait for your EOB from your insurance company, which will show the allowed amount, what insurance paid, and your actual patient responsibility. Contact the billing office to confirm they have your insurance information and are processing the claim."
  },
  "Trauma Activation Fee Issues": {
    "explanation_for_user": "Trauma activation fees are charged when a hospital's trauma team is mobilized, even if their services aren't ultimately needed. These fees can be $10,000+ and are controversial because patients often don't need the full trauma response.",
    "suggested_action": "Review your medical records to confirm a trauma activation was medically necessary. Many states are cracking down on these fees. Check if your situation qualifies for a waiver or reduction. Contact a medical billing advocate or attorney if the fee seems unjustified based on your condition."
  },
  "Collections on Invalid Bills": {
    "explanation_for_user": "Your account was sent to collections, but the underlying charges are disputed, incorrect, or you were never properly billed. Sending invalid bills to collections is a violation of the Fair Debt Collection Practices Act (FDCPA).",
    "suggested_action": "Send a debt validation letter to the collection agency within 30 days demanding proof of the debt. Dispute the charges in writing with the hospital and the collection agency. File complaints with the CFPB and your state attorney general. Consider consulting a consumer rights attorney if the issue persists."
  },
  "Ground Ambulance Balance Billing": {
    "explanation_for_user": "Ground ambulance providers, especially private companies, often balance bill patients even after insurance pays. Unlike air ambulance, ground ambulance is not yet fully protected under the No Surprises Act, though some states have their own protections.",
    "suggested_action": "Check if your state has ground ambulance billing protections. Request a detailed invoice and compare to your insurance EOB. Negotiate with the ambulance company—they often accept much less than the initial bill. If the transport was an emergency, argue for in-network rates under your insurance policy's emergency provisions."
  },
  "None": {
    "explanation_for_user": "No specific billing issue was detected for this line item based on the available information.",
    "suggested_action": "Review this charge against your memory of the visit and your medical records to ensure accuracy. If something seems off, request clarification from the billing department."
  }
}
